linear_programming.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2021-04-21 Wed 21:03 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Linear and Mixed Integer Programming</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Vaibhav Karve" />
<link rel="stylesheet" type="text/css" href="css/stylesheet.css" />
</head>
<body>
<div id="content">
<h1 class="title">Linear and Mixed Integer Programming
<br />
<span class="subtitle"><a href="index.html">Home</a></span>
</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org4eedfdc">1. Linear Programs</a>
<ul>
<li><a href="#org17f13b5">1.1. Solution to a linear program</a></li>
<li><a href="#org22ea38b">1.2. Optimality of linear programming</a></li>
<li><a href="#org425d938">1.3. List of linear program solving softwares</a></li>
<li><a href="#orgd3511a2">1.4. Vector form of linear program</a></li>
<li><a href="#orgfd308d7">1.5. Characteristics of a linear program</a></li>
<li><a href="#orgd31ecdd">1.6. Core idea behind simplex method</a></li>
<li><a href="#org278bf08">1.7. Alternative to simplex method</a></li>
<li><a href="#org6bd9023">1.8. Every linear program has a dual</a></li>
<li><a href="#orgd879657">1.9. Weak duality</a></li>
<li><a href="#org053bb5f">1.10. Strong duality</a></li>
<li><a href="#org8840bfe">1.11. Implications of duality</a></li>
<li><a href="#org8018803">1.12. Duality in optimization problems</a></li>
</ul>
</li>
<li><a href="#org0a187e9">2. Mixed Integer Linear Programs</a>
<ul>
<li><a href="#org6d9dc50">2.1. Characteristics</a></li>
<li><a href="#orgff67e8a">2.2. Enforcing logical conditions on binary variables</a></li>
<li><a href="#org224acc6">2.3. Linear program relaxation</a></li>
<li><a href="#orgf8d34bf">2.4. Turning LP-relaxation solution into an IP solution</a></li>
<li><a href="#org9919d5b">2.5. Strong vs. weak formulations of integer programs</a></li>
<li><a href="#org8411166">2.6. Constraint generation</a></li>
</ul>
</li>
</ul>
</div>
</div>
<p>
These notes are based on notes from <a href="https://asestes1.github.io/">Alexander S. Estes</a>'s INMAS 2021
workshop on <a href="https://asestes1.github.io/inmas2021/">Modeling and Optimization</a>.
</p>

<div id="outline-container-org4eedfdc" class="outline-2">
<h2 id="org4eedfdc"><span class="section-number-2">1</span> Linear Programs</h2>
<div class="outline-text-2" id="text-1">
<p>
\[\min_{x\in\mathbb{R}^n} f(x)\] subject to the constraints \[g_1(x)\le
0,\; g_2(x)\le 0,\; \ldots,\; g_k(x)\le 0.\]
</p>
</div>

<div id="outline-container-org17f13b5" class="outline-3">
<h3 id="org17f13b5"><span class="section-number-3">1.1</span> Solution to a linear program</h3>
<div class="outline-text-3" id="text-1-1">
<ul class="org-ul">
<li>\(x\) is <i>feasible</i> if it satisfies all constraints.</li>
<li><i>Feasible region</i> is the set of all feasible points.</li>
<li>\(x\) is <i>optimal</i> if it satisfies all constraints and \(f(x) \le f(y)\)
for any other feasible solution \(y\).</li>
<li><b>Goal:</b> find an optimal solution.</li>
</ul>
</div>
</div>

<div id="outline-container-org22ea38b" class="outline-3">
<h3 id="org22ea38b"><span class="section-number-3">1.2</span> Optimality of linear programming</h3>
<div class="outline-text-3" id="text-1-2">
<p>
There are 3 possibilities &#x2013;
</p>
<ol class="org-ol">
<li>LP has an optimal solution.</li>
<li>LP is infeasible &#x2013; i.e. we have too many constraints.
For example,
\[\min x\]
subject to
<ul class="org-ul">
<li>\(x\le 1\)</li>
<li>\(x\ge 2\)</li>
<li>\(x\ge 0\)</li>
</ul></li>
<li>LP is unbounded &#x2013; i.e. we have too few constraints.
For example,
\[\max x\]
subject to \(x\ge 0\).</li>
</ol>
</div>
</div>

<div id="outline-container-org425d938" class="outline-3">
<h3 id="org425d938"><span class="section-number-3">1.3</span> List of linear program solving softwares</h3>
<div class="outline-text-3" id="text-1-3">
<p>
CPLEX, COIN-OR, FICO Xpress, GLPK, <a href="https://www.gurobi.com/">Gurobi</a>, \(\ldots\)
</p>
</div>
</div>

<div id="outline-container-orgd3511a2" class="outline-3">
<h3 id="orgd3511a2"><span class="section-number-3">1.4</span> Vector form of linear program</h3>
<div class="outline-text-3" id="text-1-4">
<p>
Maximize \(c^\top x\) subject to
</p>
<ul class="org-ul">
<li>\(Ax\le b\)</li>
<li>\(x\ge 0\)</li>
</ul>

<p>
Here, \(c\) is the vector of coefficients in the objective. \(A\) is the
matrix of constraint coefficients. \(b\) is a vector of constants.
</p>
</div>
</div>
<div id="outline-container-orgfd308d7" class="outline-3">
<h3 id="orgfd308d7"><span class="section-number-3">1.5</span> Characteristics of a linear program</h3>
<div class="outline-text-3" id="text-1-5">
<ul class="org-ul">
<li>Affine constraints</li>
<li>Linear objective function</li>
<li>Can be solved efficiently</li>
<li>The feasible region is always a polyhedron</li>
<li>The optimal solution (if it exists) is always a vertex of the polyhedron.</li>
</ul>
</div>
</div>

<div id="outline-container-orgd31ecdd" class="outline-3">
<h3 id="orgd31ecdd"><span class="section-number-3">1.6</span> Core idea behind simplex method</h3>
<div class="outline-text-3" id="text-1-6">
<ul class="org-ul">
<li>The optimal solution must occur at a vertex of the polyhedron created by
all the constraints.</li>
<li>Start at a vertex. Move to neighboring vertex with lower function value.</li>
<li>This movement can be done in \(\mathcal{O}(mn)\) time, where \(m\) is the
number of constraints and \(n\) is the number of vertices of the
polyhedron (or perhaps it is the dimension of \(x\)? I am not really
sure).</li>
<li>In theory, the number of vertices in the polyhedron can depend
exponentially on \(m\).</li>
<li>But in practice, the Simplex method is very efficient and tractable.</li>
</ul>
</div>
</div>
<div id="outline-container-org278bf08" class="outline-3">
<h3 id="org278bf08"><span class="section-number-3">1.7</span> Alternative to simplex method</h3>
<div class="outline-text-3" id="text-1-7">
<p>
The interior point algorithm.
</p>
<ul class="org-ul">
<li>Runs in polynomial time.</li>
<li>Sometimes faster than the simplex method.</li>
</ul>
</div>
</div>

<div id="outline-container-org6bd9023" class="outline-3">
<h3 id="org6bd9023"><span class="section-number-3">1.8</span> Every linear program has a dual</h3>
<div class="outline-text-3" id="text-1-8">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Primal</th>
<th scope="col" class="org-left">Dual</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">\(\max_x c^\top x\qquad\)</td>
<td class="org-left">\(\min_\lambda b^\top \lambda\)</td>
</tr>

<tr>
<td class="org-left">subject to</td>
<td class="org-left">subject to</td>
</tr>

<tr>
<td class="org-left">\(Ax \le b\)</td>
<td class="org-left">\(\lambda^\top A \ge c\)</td>
</tr>

<tr>
<td class="org-left">\(x\ge 0\)</td>
<td class="org-left">\(\lambda \ge 0\)</td>
</tr>
</tbody>
</table>
</div>

<div id="outline-container-org6613d5c" class="outline-4">
<h4 id="org6613d5c"><span class="section-number-4">1.8.1</span> Example of dual problem</h4>
<div class="outline-text-4" id="text-1-8-1">
<p>
<b>Primal:</b> maximize \(4x+5y+z\) subject to
</p>
<ul class="org-ul">
<li>\(2x + 3y \le 60\)</li>
<li>\(x + 2y \le 20\)</li>
<li>\(y + z \le 10\)</li>
<li>\(x + y + z \le 15\)</li>
<li>\(x, y, z \ge 0\)</li>
</ul>

<p>
<b>Dual:</b> minimize \(60\lambda_1 + 20\lambda_2 + 10\lambda_3 + 15\lambda_4\)
</p>
<ul class="org-ul">
<li>\(2\lambda_1 + \lambda_2 + \lambda_4 \ge 4\)</li>
<li>\(3\lambda_1 + 2\lambda_2 + \lambda_3 + \lambda_4 \ge 5\)</li>
<li>\(\lambda_3 + \lambda_4 \ge 1\)</li>
<li>\(\lambda\ge 0\)</li>
</ul>
</div>
</div>
</div>

<div id="outline-container-orgd879657" class="outline-3">
<h3 id="orgd879657"><span class="section-number-3">1.9</span> Weak duality</h3>
<div class="outline-text-3" id="text-1-9">
<p>
Let \(x\) be a feasible solution to primal. Let \(\lambda\) be a feasible
solution to dual. Then, \[c^\top x \le b^\top \lambda\]
</p>

<p>
<b>Proof</b>
</p>
\begin{align*}
  \lambda^\top A &\ge c \\
  (\lambda^\top A)x &\ge c^\top x, \text{ since }x\ge 0 \\
  \lambda^\top (Ax) &\ge c^\top x \\
  \lambda^\top b &\ge c^\top x, \text{ since }b\ge Ax
\end{align*}
</div>
</div>

<div id="outline-container-org053bb5f" class="outline-3">
<h3 id="org053bb5f"><span class="section-number-3">1.10</span> Strong duality</h3>
<div class="outline-text-3" id="text-1-10">
<p>
If either the primal or the dual has an optimal solution, then both
problems do, and moreover, the objective values are equal, i.e. \[c^\top x
= b^\top \lambda.\]
</p>
</div>
</div>

<div id="outline-container-org8840bfe" class="outline-3">
<h3 id="org8840bfe"><span class="section-number-3">1.11</span> Implications of duality</h3>
<div class="outline-text-3" id="text-1-11">
<ol class="org-ol">
<li>If objectives of primal and dual solutions are close in value, then
solution is close to optimal.</li>
<li>If objectives are equal, then solutions are optimal.</li>
<li>Simplex and interior point methods are guaranteed to produce optimal
solutions to both primal and dual.</li>
<li>Intermediate solutions from interior point methods are always feasible
for both primal and dual in each iteration.</li>
<li>Intermediate solutions from simplex method might not be feasible for
dual solution in each iteration (until optimal solution is found in the
last iteration).</li>
</ol>
</div>
</div>

<div id="outline-container-org8018803" class="outline-3">
<h3 id="org8018803"><span class="section-number-3">1.12</span> Duality in optimization problems</h3>
<div class="outline-text-3" id="text-1-12">
<ul class="org-ul">
<li>Linear programs have both strong and weak duality.</li>
<li>Many convex optimization problems have strong duality.</li>
<li>Integer linear programs have weak duality.</li>
</ul>
</div>
</div>
</div>

<div id="outline-container-org0a187e9" class="outline-2">
<h2 id="org0a187e9"><span class="section-number-2">2</span> Mixed Integer Linear Programs</h2>
<div class="outline-text-2" id="text-2">
<p>
Linear programs can have fractional solutions. Rounding solutions can make
them infeasible or sub-optimal. Instead, use mixed integer linear
programming.
</p>
</div>

<div id="outline-container-org6d9dc50" class="outline-3">
<h3 id="org6d9dc50"><span class="section-number-3">2.1</span> Characteristics</h3>
<div class="outline-text-3" id="text-2-1">
<ul class="org-ul">
<li>Affine constraints</li>
<li>Linear objective functions</li>
<li>Restriction that some/all variables are in \(\mathbb{Z}\)</li>
<li>NP-Hard in general</li>
<li>Current algorithms require EXP time in worst case.</li>
<li>In practice, however, it is tractable.</li>
<li>Yes/No problems can be modeled as binary variables in the set \(\{0, 1\}\).</li>
</ul>
</div>
</div>

<div id="outline-container-orgff67e8a" class="outline-3">
<h3 id="orgff67e8a"><span class="section-number-3">2.2</span> Enforcing logical conditions on binary variables</h3>
<div class="outline-text-3" id="text-2-2">
<p>
Suppose \(x,y \in \{0, 1\}\) are binary variables.
</p>
<ul class="org-ul">
<li>\(x\le y\) enforces \(x\rightarrow y\).</li>
<li>\((1-x)\) is the same as \(\neg x\).</li>
<li>Therefore, \(1-x \le y\) enforces \(\neg x \rightarrow y\). Said
differently, \(x+y\ge 1\) enforces \(x\vee y\).</li>
</ul>
</div>
</div>

<div id="outline-container-org224acc6" class="outline-3">
<h3 id="org224acc6"><span class="section-number-3">2.3</span> Linear program relaxation</h3>
<div class="outline-text-3" id="text-2-3">
<p>
Given an Integer Program (IP), if we relax the integrality conditions on
the variables, we get a Linear Program (LP).
</p>

<p>
Here are some key facts about such a relaxation &#x2013;
</p>
<ol class="org-ol">
<li>For minimization problem, the optimal value of LP-relaxation of IP
serves as a lower bound of IP.</li>
<li>For maximization problem, optimal value of LP-relaxation of IP serves as
an upper bound of IP.</li>
<li>If optimal solution of LP-relaxation is integral, then it is also the
optimal solution to the IP.</li>
</ol>
</div>
</div>

<div id="outline-container-orgf8d34bf" class="outline-3">
<h3 id="orgf8d34bf"><span class="section-number-3">2.4</span> Turning LP-relaxation solution into an IP solution</h3>
<div class="outline-text-3" id="text-2-4">
<dl class="org-dl">
<dt>Method 1: Branching on a variable \(x\)</dt><dd>Divide feasible region into two
smaller regions \(x \le \lfloor v \rfloor\) and \(x\ge \lceil v
     \rceil\), where \(v\) is the optimal decimal solution to \(x\).</dd>
<dt>Method 2: Cut generation</dt><dd>Add a new constraint that cuts away some of
the floating-point solutions while not removing the integer solutions.</dd>
</dl>

<p>
In practice, both methods are used in conjunction.
</p>
</div>
</div>

<div id="outline-container-org9919d5b" class="outline-3">
<h3 id="org9919d5b"><span class="section-number-3">2.5</span> Strong vs. weak formulations of integer programs</h3>
<div class="outline-text-3" id="text-2-5">
<ul class="org-ul">
<li>Strong formulations have constraints close to the integral points in the
feasible region, i.e. they have no gaps between integer points and
constraints.</li>
<li>Strong formulations have less possibility of yielding floating-point
solutions and are more likely to yield integer solutions.</li>
<li>Strong formulations require less branching and cut-generation.</li>
<li>Simplex method produces optimal solutions for strong formulations.</li>
</ul>

<p>
<b>Trade-off:</b> However, strengthening a formulation can require us to
 introduce lots of new constraints, which can slow down the solver. See
 <a href="#org8411166">2.6</a>.
</p>

<p>
In practice, aim for maximizing the strength of the formulation.
</p>
</div>
</div>

<div id="outline-container-org8411166" class="outline-3">
<h3 id="org8411166"><span class="section-number-3">2.6</span> Constraint generation</h3>
<div class="outline-text-3" id="text-2-6">
<p>
The classic example to keep in mind is Traveling Salesman Problem.
</p>

<p>
Here are the steps &#x2013;
</p>
<ol class="org-ol">
<li>Start with a weak formulation</li>
<li>Solve IP without subtour elimination (in case of TSP, this is when
smaller cycles occur, which we wish to eliminate).</li>
<li>Check for subtours in resulting solution.</li>
<li>Add subtour elimination constraint.</li>
<li>Repeat until no subtours appear.</li>
<li>This solution is optimal.</li>
</ol>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Vaibhav Karve</p>
<p class="date">Created: 2021-04-21 Wed 21:03</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
